#include <cmath>
#include <memory>

#include "bel.hpp"

карыстаць вобласць std;

канст цэл НУМ_КНОПКІ_0 = 0;
канст цэл НУМ_КНОПКІ_1 = 1;
канст цэл НУМ_КНОПКІ_2 = 2;
канст цэл НУМ_КНОПКІ_3 = 3;
канст цэл НУМ_КНОПКІ_4 = 4;
канст цэл НУМ_КНОПКІ_5 = 5;
канст цэл НУМ_КНОПКІ_6 = 6;
канст цэл НУМ_КНОПКІ_7 = 7;
канст цэл НУМ_КНОПКІ_8 = 8;
канст цэл НУМ_КНОПКІ_9 = 9;
канст цэл НУМ_КНОПКІ_АЧЫСТКА = 10;
канст цэл НУМ_КНОПКІ_ДЗЯЛЕННЕ = 11;
канст цэл НУМ_КНОПКІ_ПУНКТ = 12;
канст цэл НУМ_КНОПКІ_РАЎНО = 13;
канст цэл НУМ_КНОПКІ_ЭЙЛЕР = 14;
канст цэл НУМ_КНОПКІ_ФАКТАРЫЯЛ = 15;
канст цэл НУМ_КНОПКІ_ІНВЕРСІЯ = 16;
канст цэл НУМ_КНОПКІ_МІНУС = 17;
канст цэл НУМ_КНОПКІ_МНОЖАННЕ = 18;
канст цэл НУМ_КНОПКІ_ПІ = 19;
канст цэл НУМ_КНОПКІ_ПЛЮС = 20;
канст цэл НУМ_КНОПКІ_КВАДРАТ = 21;
канст цэл НУМ_КНОПКІ_КВАДРАТНЫ_КОРАНЬ = 22;
канст цэл НУМ_КНОПКІ_УНАРНЫ_МІНУС = 23;

канст цэл СТАНДАРТНАЯ_ЁМІСТНАСЦЬ = 100;

стат НАКНО поле;
стат вектар<страка> даныя;

стат вектар<цэл> фактарыял = {1, 1, 2, 6, 24, 120, 720, 5040, 40320, 362880, 3628800, 39916800, 479001600};

стат пуст зарэгКнопку(НАКНО акно, цэл нум, страка тэкст, цэл хСеткі, цэл уСеткі);
стат НАКНО зарэгПоле(НАКНО акно);
стат пуст штурхСімвалА(страка сімвал);
стат пуст штурхАперацыю(страка аперацыя);
стат пуст вылічыцьА();

стат LRESULT працэсАкна(НАКНО акно, БЦЭЛ сігнал, ЎПАРАМ ўПарам, ЛПАРАМ лПарам)
{
	цэл нумКнопкі = малворд(ўПарам);

	выбар(сігнал)
	{
		шлях WM_CREATE:
		{
			поле = зарэгПоле(акно);

			зарэгКнопку(акно, НУМ_КНОПКІ_ПІ, "p", 0, 0);
			зарэгКнопку(акно, НУМ_КНОПКІ_ЭЙЛЕР, "e", 1, 0);
			зарэгКнопку(акно, НУМ_КНОПКІ_АЧЫСТКА, "C", 2, 0);
			зарэгКнопку(акно, НУМ_КНОПКІ_ФАКТАРЫЯЛ, "x!", 3, 0);
			зарэгКнопку(акно, НУМ_КНОПКІ_ІНВЕРСІЯ, "1/x", 0, 1);
			зарэгКнопку(акно, НУМ_КНОПКІ_КВАДРАТ, "x^2", 1, 1);
			зарэгКнопку(акно, НУМ_КНОПКІ_КВАДРАТНЫ_КОРАНЬ, "sqrt(x)", 2, 1);
			зарэгКнопку(акно, НУМ_КНОПКІ_ДЗЯЛЕННЕ, "/", 3, 1);
			зарэгКнопку(акно, НУМ_КНОПКІ_7, "7", 0, 2);
			зарэгКнопку(акно, НУМ_КНОПКІ_8, "8", 1, 2);
			зарэгКнопку(акно, НУМ_КНОПКІ_9, "9", 2, 2);
			зарэгКнопку(акно, НУМ_КНОПКІ_МНОЖАННЕ, "*", 3, 2);
			зарэгКнопку(акно, НУМ_КНОПКІ_4, "4", 0, 3);
			зарэгКнопку(акно, НУМ_КНОПКІ_5, "5", 1, 3);
			зарэгКнопку(акно, НУМ_КНОПКІ_6, "6", 2, 3);
			зарэгКнопку(акно, НУМ_КНОПКІ_МІНУС, "-", 3, 3);
			зарэгКнопку(акно, НУМ_КНОПКІ_1, "1", 0, 4);
			зарэгКнопку(акно, НУМ_КНОПКІ_2, "2", 1, 4);
			зарэгКнопку(акно, НУМ_КНОПКІ_3, "3", 2, 4);
			зарэгКнопку(акно, НУМ_КНОПКІ_ПЛЮС, "+", 3, 4);
			зарэгКнопку(акно, НУМ_КНОПКІ_УНАРНЫ_МІНУС, "-", 0, 5);
			зарэгКнопку(акно, НУМ_КНОПКІ_0, "0", 1, 5);
			зарэгКнопку(акно, НУМ_КНОПКІ_ПУНКТ, ".", 2, 5);
			зарэгКнопку(акно, НУМ_КНОПКІ_РАЎНО, "=", 3, 5);
			злом;
		}
		шлях WM_COMMAND:
		{
			выбар(нумКнопкі)
			{
				шлях НУМ_КНОПКІ_0:
				{
					штурхСімвалА("0");
					злом;
				}
				шлях НУМ_КНОПКІ_1:
				{
					штурхСімвалА("1");
					злом;
				}
				шлях НУМ_КНОПКІ_2:
				{
					штурхСімвалА("2");
					злом;
				}
				шлях НУМ_КНОПКІ_3:
				{
					штурхСімвалА("3");
					злом;
				}
				шлях НУМ_КНОПКІ_4:
				{
					штурхСімвалА("4");
					злом;
				}
				шлях НУМ_КНОПКІ_5:
				{
					штурхСімвалА("5");
					злом;
				}
				шлях НУМ_КНОПКІ_6:
				{
					штурхСімвалА("6");
					злом;
				}
				шлях НУМ_КНОПКІ_7:
				{
					штурхСімвалА("7");
					злом;
				}
				шлях НУМ_КНОПКІ_8:
				{
					штурхСімвалА("8");
					злом;
				}
				шлях НУМ_КНОПКІ_9:
				{
					штурхСімвалА("9");
					злом;
				}
				шлях НУМ_КНОПКІ_ЭЙЛЕР:
				{
					штурхСімвалА("2.72");
					злом;
				}
				шлях НУМ_КНОПКІ_ПІ:
				{
					штурхСімвалА("3.14");
					злом;
				}
				шлях НУМ_КНОПКІ_ПУНКТ:
				{
					штурхСімвалА(".");
					злом;
				}
				шлях НУМ_КНОПКІ_УНАРНЫ_МІНУС:
				{
					штурхСімвалА("-");
					злом;
				}
				шлях НУМ_КНОПКІ_АЧЫСТКА:
				{
					даныя.clear();
					SetWindowTextA(поле, "");
					злом;
				}
				шлях НУМ_КНОПКІ_ДЗЯЛЕННЕ:
				{
					штурхАперацыю("/");
					злом;
				}
				шлях НУМ_КНОПКІ_МНОЖАННЕ:
				{
					штурхАперацыю("*");
					злом;
				}
				шлях НУМ_КНОПКІ_МІНУС:
				{
					штурхАперацыю("-");
					злом;
				}
				шлях НУМ_КНОПКІ_ПЛЮС:
				{
					штурхАперацыю("+");
					злом;
				}
				шлях НУМ_КНОПКІ_ФАКТАРЫЯЛ:
				{
					штурхАперацыю("!");
					злом;
				}
				шлях НУМ_КНОПКІ_КВАДРАТ:
				{
					штурхАперацыю("s");
					злом;
				}
				шлях НУМ_КНОПКІ_ІНВЕРСІЯ:
				{
					штурхАперацыю("i");
					злом;
				}
				шлях НУМ_КНОПКІ_КВАДРАТНЫ_КОРАНЬ:
				{
					штурхАперацыю("r");
					злом;
				}
				шлях НУМ_КНОПКІ_РАЎНО:
				{
					вылічыцьА();
					злом;
				}
			}
			злом;
		}

		шлях WM_CLOSE:
		{
			DestroyWindow(акно);
			злом;
		}
		шлях WM_DESTROY:
		{
			PostQuitMessage(0);
			злом;
		}
	}
	вярнуць DefWindowProcA(акно, сігнал, ўПарам, лПарам);
}

цэл уваход()
{
	страка імяКласа = "HummelCalculator";
	страка назваАкна = "WinAPI";

	АКНОКЛАС класАкна;
	класАкна.style = 0;
	класАкна.lpfnWndProc = працэсАкна;
	класАкна.cbClsExtra = 0;
	класАкна.cbWndExtra = 0;
	класАкна.hInstance = адсут;
	класАкна.hIcon = адсут;
	класАкна.hCursor = адсут;
	класАкна.hbrBackground = (НПЭНДЗ)(COLOR_WINDOW + 1);
	класАкна.lpszMenuName = адсут;
	класАкна.lpszClassName = імяКласа.c_str();

	RegisterClassA(&класАкна);

	цэл шырыняЭкрана = GetSystemMetrics(SM_CXSCREEN);
	цэл вышыняЭкрана = GetSystemMetrics(SM_CYSCREEN);

	цэл шырыняАкна = 248;
	цэл вышыняАкна = 440;

	цэл хАкна = max(0, (шырыняЭкрана - шырыняАкна) / 2);
	цэл уАкна = max(0, (вышыняЭкрана - вышыняАкна) / 2);

	CreateWindowExA(0, імяКласа.c_str(), назваАкна.c_str(), WS_VISIBLE | WS_CAPTION | WS_SYSMENU, хАкна, уАкна, шырыняАкна, вышыняАкна, адсут, адсут, адсут, адсут);

	ВЕСТКА вестка;
	пакуль(GetMessageA(&вестка, адсут, 0, 0) != 0)
	{
		TranslateMessage(&вестка);
		DispatchMessageA(&вестка);
	}
}

стат пуст вылічыць();
стат пуст вылічыцьА()
{
	спроба
	{
		вылічыць();
	}
	няўдача(праблема & п)
	{
		даныя.clear();
		SetWindowTextA(поле, "Error!");
	}
}

стат пуст вылічыць()
{
	аўта буфер = унікальны<сімв[]>(СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);
	GetWindowTextA(поле, буфер.get(), СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);

	калі(даныя.size() == 2)
	{
		страка аператар = даныя[1];
		мноства<страка> аператары1 = {"+", "-", "*", "/"};
		мноства<страка> аператары2 = {"!", "s", "i", "r"};

		калі(аператары1.count(аператар) > 0)
		{
			страка стр(буфер.get());
			даныя.push_back(стр);

			дроб8 аперанд1 = stod(даныя[0]);
			дроб8 аперанд2 = stod(даныя[2]);

			дроб8 рэзультат;
			калі(аператар == "+")
			{
				рэзультат = аперанд1 + аперанд2;
			}
			інакш калі(аператар == "-")
			{
				рэзультат = аперанд1 - аперанд2;
			}
			інакш калі(аператар == "*")
			{
				рэзультат = аперанд1 * аперанд2;
			}
			інакш калі(аператар == "/")
			{
				рэзультат = аперанд1 / аперанд2;
			}
			інакш
			{
				ёсць праблема();
			}

			даныя.clear();

			SetWindowTextA(поле, to_string(рэзультат).c_str());
		}
		інакш калі(аператары2.count(аператар) > 0)
		{
			дроб8 аперанд = stod(даныя[0]);

			дроб8 рэзультат;
			калі(аператар == "!")
			{
				рэзультат = фактарыял[(цэл)аперанд];
			}
			інакш калі(аператар == "s")
			{
				рэзультат = аперанд * аперанд;
			}
			інакш калі(аператар == "i")
			{
				рэзультат = 1.0 / аперанд;
			}
			інакш калі(аператар == "r")
			{
				рэзультат = sqrt(аперанд);
			}
			інакш
			{
				ёсць праблема();
			}

			даныя.clear();

			SetWindowTextA(поле, to_string(рэзультат).c_str());
		}
	}
}

стат пуст штурхАперацыю(страка аперацыя)
{
	аўта буфер = унікальны<сімв[]>(СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);
	GetWindowTextA(поле, буфер.get(), СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);

	калі(даныя.size() == 0)
	{
		страка стр(буфер.get());
		даныя.push_back(стр);
		даныя.push_back(аперацыя);
		SetWindowTextA(поле, "");
	}
	інакш
	{
		даныя.clear();
		SetWindowTextA(поле, "Error!");
	}
}

стат пуст штурхСімвал(страка сімвал);
стат пуст штурхСімвалА(страка сімвал)
{
	аўта буфер = унікальны<сімв[]>(СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);
	GetWindowTextA(поле, буфер.get(), СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);
	страка стр(буфер.get());

	калі(сімвал == "3.14" || сімвал == "2.72" || сімвал == "-")
	{
		калі(стр.size() == 0)
		{
			штурхСімвал(сімвал);
		}
	}
	інакш калі(сімвал == ".")
	{
		калі(стр.find(".") == страка::npos && стр.size() != 0)
		{
			штурхСімвал(сімвал);
		}
	}
	інакш
	{
		калі(даныя.size() == 0)
		{
			штурхСімвал(сімвал);
		}
		інакш
		{
			страка аператар = даныя[1];
			мноства<страка> аператары = {"!", "s", "i", "r"};

			калі(аператары.count(аператар) <= 0)
			{
				штурхСімвал(сімвал);
			}
		}
	}
}

стат пуст штурхСімвал(страка сімвал)
{
	аўта буфер = унікальны<сімв[]>(СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);
	GetWindowTextA(поле, буфер.get(), СТАНДАРТНАЯ_ЁМІСТНАСЦЬ);
	страка стр(буфер.get());
	калі(стр == "Error!")
	{
		SetWindowTextA(поле, сімвал.c_str());
	}
	інакш
	{
		SetWindowTextA(поле, (стр + сімвал).c_str());
	}
}

стат НАКНО зарэгПоле(НАКНО акно)
{
	вярнуць CreateWindowExA(
		WS_EX_CLIENTEDGE,
		"STATIC",
		"",
		WS_TABSTOP | WS_VISIBLE | WS_CHILD,
		1,
		1,
		239,
		48,
		акно,
		адсут,
		адсут,
		адсут);
}

стат пуст зарэгКнопку(НАКНО акно, цэл нум, страка тэкст, цэл хСеткі, цэл уСеткі)
{
	цэл шырыняКнопкі = 60;
	цэл вышыняКнопкі = 60;

	CreateWindowExA(
		WS_EX_CLIENTEDGE,
		"BUTTON",
		тэкст.c_str(),
		WS_TABSTOP | WS_VISIBLE | WS_CHILD,
		шырыняКнопкі * хСеткі + 1,
		вышыняКнопкі * уСеткі + 50,
		шырыняКнопкі,
		вышыняКнопкі,
		акно,
		рэінт_прывядз<НМЕНЮ>(нум),
		адсут,
		адсут);
}