#include <iomanip>

#include "bel.hpp"

карыстаць вобласць std;

вобласць беларусь
{
	клас лаб0201
	{
	публіч:
		стат пуст вывадМатрыцы(вектар<вектар<цэл>> мас)
		{
			для(вектар<цэл> радок : мас)
			{
				для(цэл лічба : радок)
				{
					вывад << setw(3) << лічба;
				}
				вывад << абзац;
			}
		}

		стат вектар<вектар<цэл>> сум(вектар<вектар<цэл>> мас1, вектар<вектар<цэл>> мас2)
		{
			вектар<вектар<цэл>> рэз(3, вектар<цэл>(3, 0));

			для(цэл і = 1; і < мас1.size(); і++)
			{
				для(цэл ж = 1; ж < мас1[і].size(); ж++)
				{
					рэз[і][ж] = мас1[і][ж] + мас2[і][ж];
				}
			}
			вярнуць рэз;
		}

		стат пуст сум(вектар<вектар<цэл>> мас1, вектар<вектар<цэл>> мас2, вектар<вектар<цэл>> &рэз)
		{
			для(цэл і = 1; і < мас1.size(); і++)
			{
				для(цэл ж = 1; ж < мас1[і].size(); ж++)
				{
					рэз[і][ж] = мас1[і][ж] + мас2[і][ж];
				}
			}
		}

		стат пуст запуск()
		{
			вектар<вектар<цэл>> мас1 = {{1, -1, 0}, {2, 0, -1}, {1, 1, 1}};
			вектар<вектар<цэл>> мас2 = {{5, 3, 1}, {-1, 2, 0}, {-3, 0, 0}};

			вывадМатрыцы(мас1);
			вывад << абзац;

			вывадМатрыцы(мас2);
			вывад << абзац;

			вектар<вектар<цэл>> рэз1 = сум(мас1, мас2);
			вывадМатрыцы(рэз1);
			вывад << абзац;

			вектар<вектар<цэл>> рэз2(3, вектар<цэл>(3, 0));
			сум(мас1, мас2, рэз2);
			вывадМатрыцы(рэз2);
		}
	};
}
