#include "bel.hpp"

карыстаць вобласць std;

вобласць беларусь
{
	клас лаб0212
	{
	публіч:
		структ Вузел
		{
			цэл знач;
			Вузел *наст;
		};

		прыравн Вузел *паказ;

		стат пуст штурх(паказ &першы, паказ &апошні, канст цэл знач)
		{
			паказ новыВузел = стварыць Вузел;
			новыВузел->знач = знач;
			новыВузел->наст = адсутпаказ;

			калі(першы == адсутпаказ)
			{
				першы = новыВузел;
			}
			інакш
			{
				апошні->наст = новыВузел;
			}

			апошні = новыВузел;
		}

		стат пуст запуск()
		{
			паказ першы1 = адсутпаказ, апошні1 = адсутпаказ;
			паказ першы2 = адсутпаказ, апошні2 = адсутпаказ;

			вывад << "Enter the number: ";
			цэл н;
			ўвод >> н;

			цэл рэзультат = 1;

			для(цэл і = 1; і <= н; і++)
			{
				штурх(першы1, апошні1, і);
				штурх(першы2, апошні2, н - і + 1);
			}

			пакуль(першы1 != адсутпаказ || першы2 != адсутпаказ)
			{
				рэзультат = рэзультат * (першы1->знач + першы2->знач);

				першы1 = першы1->наст;
				першы2 = першы2->наст;
			}

			вывад << рэзультат << абзац;
		}
	};
}
