#include <cmath>

#include "bel.hpp"

карыстаць вобласць std;

вобласць беларусь
{
	клас лаб0101
	{
	публіч:
		стат пуст запуск()
		{
			дроб8 х = 0.6;
			пакуль(х <= 1.1)
			{
				для(цэл н = 10; н <= 15; н++)
				{
					дроб8 сум = 0;
					для(цэл к = 1; к <= н; к++)
					{
						дроб8 часткаП1 = exp(1.2 * к);
						дроб8 часткаП2 = (к - 10) / (к + 30);
						дроб8 лічнік = exp(log(часткаП1 + часткаП2) / к);
						дроб8 часткаП3 = sqrt(к * exp(log(н + 5) / 3));
						дроб8 часткаП4 = log(sqrt(н * х));
						дроб8 назоўнік = часткаП3 + часткаП4;
						сум += лічнік / назоўнік;
					}
					дроб8 часткаЛ1 = exp(н * х) / 2;
					дроб8 часткаЛ2 = exp(log(н * х) / 3);
					дроб8 ф = сум + exp(log(часткаЛ1 + часткаЛ2) / 3);
					вывад << "X = " << х << ", N = " << н << ", F = " << ф << абзац;
				}
				х += 0.1;
			}
		}
	};
}
