#include "bel.hpp"

карыстаць вобласць std;

вобласць беларусь
{
	клас лаб0102
	{
	публіч:
		стат пуст запуск()
		{
			цэл н;
			вывад << "Enter the quantity of elements: ";
			ўвод >> н;

			вектар<цэл> мас(н, 0);
			для(цэл і = 0; і <= н - 1; і++)
			{
				вывад << "Enter the element: ";
				ўвод >> мас[і];
				калі (мас[і] < 0)
				{
					мас[і] *= -1;
				}
			}

			для(цэл і = 0; і <= н - 2; і++)
			{
				калі (мас[і] != 0)
				{
					пакуль(мас[і] != 0)
					{
						калі (мас[і] < мас[і + 1])
						{
							мас[і + 1] = мас[і + 1] % мас[і];
						}
						інакш
						{
							цэл час = мас[і];
							мас[і] = мас[і + 1];
							мас[і + 1] = час;
						}
					}
				}
			}

			вывад << "GCD is " << мас[н - 1] << абзац;
		}
	};
}
